irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_dma_2307_IUT.c
    CS_CMM_PROBE_NODE_STMT(58,0,8) ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0000))->IFCR |= ((uint32_t)0x0000F000);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(59,7,9) if (DMAy_Channelx == ((DMA_Channel_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0058)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable279,278) 

    
    CS_CMM_PROBE_NODE_STMT(59,6,10) ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0000))->IFCR |= ((uint32_t)0x000F0000);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(59,5,11) if (DMAy_Channelx == ((DMA_Channel_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x006C)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable280,279) 

    
    CS_CMM_PROBE_NODE_STMT(59,4,12) ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0000))->IFCR |= ((uint32_t)0x00F00000);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(59,3,13) if (DMAy_Channelx == ((DMA_Channel_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0080)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable281,280) 

    
    CS_CMM_PROBE_NODE_STMT(59,2,14) ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0000))->IFCR |= ((uint32_t)0x0F000000);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(59,1,15) if (DMAy_Channelx == ((DMA_Channel_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0408)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable282,281) 

    
    CS_CMM_PROBE_NODE_STMT(59,0,16) ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0400))->IFCR |= ((uint32_t)0x0000000F);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(60,7,17) if (DMAy_Channelx == ((DMA_Channel_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x041C)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable283,282) 

    
    CS_CMM_PROBE_NODE_STMT(60,6,18) ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0400))->IFCR |= ((uint32_t)0x000000F0);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(60,5,19) if (DMAy_Channelx == ((DMA_Channel_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0430)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable284,283) 

    
    CS_CMM_PROBE_NODE_STMT(60,4,20) ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0400))->IFCR |= ((uint32_t)0x00000F00);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(60,3,21) if (DMAy_Channelx == ((DMA_Channel_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0444)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable285,284) 

    
    CS_CMM_PROBE_NODE_STMT(60,2,22) ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0400))->IFCR |= ((uint32_t)0x0000F000);
  }
  else
  {
    
    CS_CMM_PROBE_NODE_STMT(60,1,23) if (DMAy_Channelx == ((DMA_Channel_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0458)))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable286,285) 

      
      CS_CMM_PROBE_NODE_STMT(60,0,24) ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0400))->IFCR |= ((uint32_t)0x000F0000);
    } CS_CMM_ELSE_PROBE_C1(286) 
  }
  }
  }
  }
  }
  }
  }
  }
  }
  }
  }

CS_CMM_PROBE_NODE_STMT(61,7,25) 
 CODESCROLL_FUNC_END(108, 9, 191) } CODESCROLL_FUNC_END_RBRACE 
/* # 202 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dma.c"*/
void DMA_Init(DMA_Channel_TypeDef* DMAy_Channelx, DMA_InitTypeDef* DMA_InitStruct)
{ CODESCROLL_FUNC_BEGIN(109, (109, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable287,287) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable288,61,6,0)

  uint32_t tmpreg = 0;


  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);



  tmpreg = DMAy_Channelx->CCR;

  tmpreg &= ((uint32_t)0xFFFF800F);
/* # 232 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dma.c"*/
  tmpreg |= DMA_InitStruct->DMA_DIR | DMA_InitStruct->DMA_Mode |
            DMA_InitStruct->DMA_PeripheralInc | DMA_InitStruct->DMA_MemoryInc |
            DMA_InitStruct->DMA_PeripheralDataSize | DMA_InitStruct->DMA_MemoryDataSize |
            DMA_InitStruct->DMA_Priority | DMA_InitStruct->DMA_M2M;


  DMAy_Channelx->CCR = tmpreg;



  DMAy_Channelx->CNDTR = DMA_InitStruct->DMA_BufferSize;



  DMAy_Channelx->CPAR = DMA_InitStruct->DMA_PeripheralBaseAddr;



  DMAy_Channelx->CMAR = DMA_InitStruct->DMA_MemoryBaseAddr;

CS_CMM_PROBE_NODE_STMT(61,5,1) 
 CODESCROLL_FUNC_END(109, 9, 251) } CODESCROLL_FUNC_END_RBRACE 







void DMA_StructInit(DMA_InitTypeDef* DMA_InitStruct)
{ CODESCROLL_FUNC_BEGIN(110, (110, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable289,288) 


  
  CS_CMM_PROBE_NODE_STMT(61,4,0) DMA_InitStruct->DMA_PeripheralBaseAddr = 0;

  DMA_InitStruct->DMA_MemoryBaseAddr = 0;

  DMA_InitStruct->DMA_DIR = ((uint32_t)0x00000000);

  DMA_InitStruct->DMA_BufferSize = 0;

  DMA_InitStruct->DMA_PeripheralInc = ((uint32_t)0x00000000);

  DMA_InitStruct->DMA_MemoryInc = ((uint32_t)0x00000000);

  DMA_InitStruct->DMA_PeripheralDataSize = ((uint32_t)0x00000000);

  DMA_InitStruct->DMA_MemoryDataSize = ((uint32_t)0x00000000);

  DMA_InitStruct->DMA_Mode = ((uint32_t)0x00000000);

  DMA_InitStruct->DMA_Priority = ((uint32_t)0x00000000);

  DMA_InitStruct->DMA_M2M = ((uint32_t)0x00000000);

CS_CMM_PROBE_NODE_STMT(61,3,1) 
 CODESCROLL_FUNC_END(110, 9, 284) } CODESCROLL_FUNC_END_RBRACE 
/* # 294 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dma.c"*/
void DMA_Cmd(DMA_Channel_TypeDef* DMAy_Channelx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(111, (111, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable290,289) 

  
  CS_CMM_PROBE_NODE_STMT(61,2,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(61,1,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable291,290) 

    
    CS_CMM_PROBE_NODE_STMT(61,0,2) DMAy_Channelx->CCR |= ((uint32_t)0x00000001);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable292,291) 

    
    CS_CMM_PROBE_NODE_STMT(62,7,3) DMAy_Channelx->CCR &= ((uint32_t)0xFFFFFFFE);
  }

