irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_dma_2307_IUT.c
CS_CMM_PROBE_NODE_STMT(62,6,4) 
 CODESCROLL_FUNC_END(111, 9, 310) } CODESCROLL_FUNC_END_RBRACE 
/* # 326 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dma.c"*/
void DMA_ITConfig(DMA_Channel_TypeDef* DMAy_Channelx, uint32_t DMA_IT, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(112, (112, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable293,292) 

  
  CS_CMM_PROBE_NODE_STMT(62,5,0) ((void)0);
  ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(62,4,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable294,293) 

    
    CS_CMM_PROBE_NODE_STMT(62,3,2) DMAy_Channelx->CCR |= DMA_IT;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable295,294) 

    
    CS_CMM_PROBE_NODE_STMT(62,2,3) DMAy_Channelx->CCR &= ~DMA_IT;
  }

CS_CMM_PROBE_NODE_STMT(62,1,4) 
 CODESCROLL_FUNC_END(112, 9, 342) } CODESCROLL_FUNC_END_RBRACE 
/* # 352 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dma.c"*/
uint16_t DMA_GetCurrDataCounter(DMA_Channel_TypeDef* DMAy_Channelx)
{ CODESCROLL_FUNC_BEGIN(113, (113, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable296,295) 

  
  CS_CMM_PROBE_NODE_STMT(62,0,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(63,7,1) 
   CODESCROLL_FUNC_END(113, 9, 357) return ((uint16_t)(DMAy_Channelx->CNDTR));
} CODESCROLL_FUNC_END_RBRACE 
/* # 414 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dma.c"*/
FlagStatus DMA_GetFlagStatus(uint32_t DMA_FLAG)
{ CODESCROLL_FUNC_BEGIN(114, (114, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable297,296) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable298,63,6,0)

  FlagStatus bitstatus = RESET;
  uint32_t tmpreg = 0;

  ((void)0);


  
  CS_CMM_PROBE_NODE_STMT(63,5,1) if ((DMA_FLAG & ((uint32_t)0x10000000)) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable299,297) 

    
    CS_CMM_PROBE_NODE_STMT(63,4,2) tmpreg = ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0400))->ISR ;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable300,298) 

    
    CS_CMM_PROBE_NODE_STMT(63,3,3) tmpreg = ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0000))->ISR ;
  }


  
  CS_CMM_PROBE_NODE_STMT(63,2,4) if ((tmpreg & DMA_FLAG) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable301,299) 

    
    CS_CMM_PROBE_NODE_STMT(63,1,5) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable302,300) 

    
    CS_CMM_PROBE_NODE_STMT(63,0,6) bitstatus = RESET;
  }


  
  CS_CMM_PROBE_NODE_STMT(64,7,7) 
   CODESCROLL_FUNC_END(114, 9, 446) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 503 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dma.c"*/
void DMA_ClearFlag(uint32_t DMA_FLAG)
{ CODESCROLL_FUNC_BEGIN(115, (115, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable303,301) 

  
  CS_CMM_PROBE_NODE_STMT(64,6,0) ((void)0);


  
  CS_CMM_PROBE_NODE_STMT(64,5,1) if ((DMA_FLAG & ((uint32_t)0x10000000)) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable304,302) 

    
    CS_CMM_PROBE_NODE_STMT(64,4,2) ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0400))->IFCR = DMA_FLAG;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable305,303) 

    
    CS_CMM_PROBE_NODE_STMT(64,3,3) ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0000))->IFCR = DMA_FLAG;
  }

CS_CMM_PROBE_NODE_STMT(64,2,4) 
 CODESCROLL_FUNC_END(115, 9, 519) } CODESCROLL_FUNC_END_RBRACE 
/* # 575 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dma.c"*/
ITStatus DMA_GetITStatus(uint32_t DMA_IT)
{ CODESCROLL_FUNC_BEGIN(116, (116, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable306,304) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable307,64,1,0)

  ITStatus bitstatus = RESET;
  uint32_t tmpreg = 0;

  ((void)0);


  
  CS_CMM_PROBE_NODE_STMT(64,0,1) if ((DMA_IT & ((uint32_t)0x10000000)) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable308,305) 

    
    CS_CMM_PROBE_NODE_STMT(65,7,2) tmpreg = ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0400))->ISR ;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable309,306) 

    
    CS_CMM_PROBE_NODE_STMT(65,6,3) tmpreg = ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0000))->ISR ;
  }


  
  CS_CMM_PROBE_NODE_STMT(65,5,4) if ((tmpreg & DMA_IT) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable310,307) 

    
    CS_CMM_PROBE_NODE_STMT(65,4,5) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable311,308) 

    
    CS_CMM_PROBE_NODE_STMT(65,3,6) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(65,2,7) 
   CODESCROLL_FUNC_END(116, 9, 606) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 663 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dma.c"*/
void DMA_ClearITPendingBit(uint32_t DMA_IT)
{ CODESCROLL_FUNC_BEGIN(117, (117, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable312,309) 

  
  CS_CMM_PROBE_NODE_STMT(65,1,0) ((void)0);


  
  CS_CMM_PROBE_NODE_STMT(65,0,1) if ((DMA_IT & ((uint32_t)0x10000000)) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable313,310) 

    
    CS_CMM_PROBE_NODE_STMT(66,7,2) ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0400))->IFCR = DMA_IT;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable314,311) 

    
    CS_CMM_PROBE_NODE_STMT(66,6,3) ((DMA_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x0000))->IFCR = DMA_IT;
  }

CS_CMM_PROBE_NODE_STMT(66,5,4) 
 CODESCROLL_FUNC_END(117, 9, 679) } CODESCROLL_FUNC_END_RBRACE 
